app/views/genres/show.html.erb

<ul>
<% @genre.movies.each do |movie| %>
---
SELECT "movies".* FROM "movies" WHERE "movies"."genre_id" = ?  [["genre_id", 4]]