app/views/movies/_form.html.erb

    <%= f.label :genre_id %>
	<%= f.collection_select :genre_id, Genre.all, :id, :name, :include_blank => "Select from list" %>
---
SELECT "genres".* FROM "genres"