app/views/movies/show.html.erb

SELECT  1 AS one FROM "comments" WHERE "comments"."movie_id" = ? LIMIT ?  [["movie_id", 4], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."movie_id" = ?  [["movie_id", 4]]
---
<br />
<% if @movie.comments.empty? %>