app/controllers/comments_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "movie_id", "stars", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "First post"], ["user_id", 4], ["movie_id", 4], ["stars", 3], ["created_at", "2018-02-13 15:51:15.205538"], ["updated_at", "2018-02-13 15:51:15.205538"]]
---
	def create
		@movie = Movie.find params[:movie_id]
		@comment = @movie.comments.new(comment_params)
		@comment.user_id = @current_user.id
		@comment.save