app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "movies"
---
  def index
	@movies = Movie.paginate(:page => params[:page], :per_page => 3)

INSERT INTO "movies" ("title", "poster", "trailer", "released_on", "rating", "genre_id", "created_at", "updated_at", "price") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "trailer" = ?, "price" = ?, "released_on" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["trailer", "n/a"], ["price", 7.5], ["released_on", "2014-01-24"], ["updated_at", "2018-02-12 18:43:45.331084"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)